---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyAutojoin
source: html/d24a9d34-f2d9-6fe7-108c-3af6fa8ceb69.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyAutojoin Property

"Automatically joins geometry to walls"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyAutojoin { get; }
```